{
    "custom-fonts": {
        "notifications": {
            "fontAdded": "Font has been loaded. If newly created drawing doesn't display it, try moving it, or changing to other scene and back.",
            "connectionError": "Fonts from Google Fonts cannot be loaded since there is an issue with the network connection: {error}",
            "invalidDirectory": "The configuration for the font directory is currently invalid and fonts could not be loaded: {error}",
            "missingFont": {
                "message": "Missing font {font} is currently being used in {context}.",
                "context": {
                    "ui": "the UI",
                    "drawing": "a Drawing",
                    "journal": "a Journal Entry"
                }
            },
            "libWrapperRequired": "libWrapper must be enabled to use the sharper text drawings functionality.",
            "presetLoaded": "Preset \"{preset}\" succesfully applied! You may now disable the preset module.",
            "invalidPreset": "Invalid preset \"{preset}\": {error}"
        },
        "settings": {
            "downloadCSS": {
                "name": "Download CSS",
                "label": "Download the Custom Fonts CSS file",
                "hint": "This is for use by Developers and Content Creators. It will download a CSS file to your computer containing the code needed to load your fonts. See the README for more info."
            },
            "fonts": {
                "name": "Google Fonts",
                "hint": "Font families to load from Google Fonts, separated with commas (,)."
            },
            "directory": {
                "name": "Local font directory",
                "hint": "Any .otf, .ttf, .woff, or .woff2 files in this directory will be loaded."
            },
            "primary": {
                "name": "Primary font",
                "hint": "Enter the name of a font which will be used for all major user interface text and as the default font family for drawings."
            },
            "mono": {
                "name": "Monospace font",
                "hint": "Enter the name of a font which will be used as the monospace font. By default you'll see this font in text areas such as the chat form or macro editor among other places."
            },
            "sharperTextDrawings": {
                "name": "Sharper Text Drawings",
                "hint": "Increases the resolution of text Drawings and removes their stroke & text shadow."
            }
        }
    }
}
