{
    "custom-fonts": {
        "notifications": {
            "fontAdded": "La police a été ajouté. Si des dessins nouvellemment créer ne l'affichent pas, essaie de bougé le dessin ou de changé de scène.",
            "connectionError": "Les polices Google Fonts ne peuvent pas être téléchargez car il y un problème avec la connection au réseau: {error}",
            "invalidDirectory": "La configuration de le fichier pour les polices est couramment invalide, donc ils n'ont pas pu être téléchargez: {error}",
            "missingFont": {
                "message": "La police {font} est actuellement utilisé pour {context}.",
                "context": {
                    "ui": "l'interface utilisateur",
                    "drawing": "un dessin",
                    "journal": "un journal"
                }
            },
            "libWrapperRequired": "libWrapper doit être activé pour utiliser la fonctionnalité de Dessins plus net."
        },
        "settings": {
            "downloadCSS": {
                "name": "Télécharger CSS",
                "label": "Télécharger le fichier CSS des polices",
                "hint": "Pour les développeurs et les créateurs de contenu. Cela va télécharger un fichier CSS sur votre ordis contenant le code nécessaire pour que vos polices soient chargés par vos utilisateurs. Voir le README pour plus d'infos."
            },
            "fonts": {
                "name": "Google Fonts",
                "hint": "Écrire une list de familles de police à téléchargez à partir de Google Fonts, separé par des virgules (,)."
            },
            "directory": {
                "name": "Répertoire de polices locale",
                "hint": "Tout fichier de formats .otf, .ttf, .woff, ou .woff2 dans cet emplacement sera téléchargé."
            },
            "primary": {
                "name": "Police Principale",
                "hint": "Entrez le nom de la police que vous voulez utiliser pour tout text primaire de l'interface utilisateur ainsi que la police par défaut pour les dessins."
            },
            "mono": {
                "name": "Police à espacement fixe",
                "hint": "Entrez le nom de la police que vous voulez utiliser pour tout texte à espacement fixe de l'interface utilisateur. Par défaut, vous verrez cette police dans les zones de texte tels que le formulaire de chat ou l'éditeur de macros."
            },
            "sharperTextDrawings": {
                "name": "Dessins de texte plus net",
                "hint": "Augmente la résolution des Dessins de texte et enlève leur contour et ombre."
            }
        }
    }
}